[["# Study of apartment sales ads\n", "\n", "We have at our disposal data from the Yandex.Real Estate service — a database of apartment sales ads in Saint Petersburg and neighboring towns for several years. The goal of the study is to determine the market value of real estate properties.  \n", "\n", "For each apartment for sale, two types of data are available. The first type is entered by the user, and the second type is obtained automatically based on map data. For example, the distance to the city center, airport, nearest park, and body of water."], ["**Data description:**  \n", "`airports_nearest` — distance to the nearest airport in meters (m)  \n", "`balcony` — number of balconies  \n", "`ceiling_height` — ceiling height in meters (m)  \n", "`cityCenters_nearest` — distance to the city center in meters (m)  \n", "`days_exposition` — how many days the ad was active (from publication to removal)  \n", "`first_day_exposition` — publication date  \n", "`floor` — floor number  \n", "`floors_total` — total number of floors in the building  \n", "`is_apartment` — whether it is an apartment (boolean type)  \n", "`kitchen_area` — kitchen area in square meters (m²)  \n", "`last_price` — price at the time of ad removal  \n", "`living_area` — living area in square meters (m²)  \n", "`locality_name` — name of the locality  \n", "`open_plan` — open floor plan (boolean type)  \n", "`parks_around3000` — number of parks within a 3 km radius  \n", "`parks_nearest` — distance to the nearest park in meters (m)  \n", "`ponds_around3000` — number of bodies of water within a 3 km radius  \n", "`ponds_nearest` — distance to the nearest body of water in meters (m)  \n", "`rooms` — number of rooms  \n", "`studio` — studio apartment (boolean type)  \n", "`total_area` — total area of the apartment in square meters (m²)  \n", "`total_images` — number of photos of the apartment in the ad  "], ["## Dataset Loading and General Information Analysis"], ["At first glance, the data appears to be natural, and no significantly outliers are visible in the graphs.  \n", "The data column types require transformation.  \n", "There are many missing values in the data, so we need to attempt to fill them in.  \n", "We also need to check the data for obvious duplicates, specifically duplicates in the column with location names."], ["## Data Preprocessing"], ["### Data Type Conversion"], ["The data types of the columns are adjusted to match the data stored in them."], ["### Finding and Replacing Duplicates"], ["It makes sense to search for duplicates only in the column with location names among all the columns with data."], ["First, let's determine how many unique values we have initially.  "], ["There are 365 unique values in the list of localities.  \n", "Let's see if the number of values decreases if we convert all values to the same case."], ["The number of unique values did not decrease. Let's try replacing 'ё' with 'е'."], ["The number of unique values decreased by 34.  \n", "Now let's try removing the names of locality types."], ["The number of unique values decreased by another 25.  \n", "In the end, we reduced the number of unique names from 365 to 306."], ["### Filling in Missing Values and Handling Anomalous Data"], ["#### Filling in the Missing Values in the 'rooms' Column"], ["There are 197 zero values in the 'rooms' column, which contradicts the nature of the feature since a room cannot have 0 rooms. Let's replace the zero values with ones."], ["#### Filling in the Missing Values in the 'cityCenters_nearest' Column"], ["First, let's rename the column."], ["Most of the missing values for the distance to the city center are in L.O., and there are only 61 missing values in St. Petersburg.  \n", "When filling in the missing values, we can rely on the data of objects located in the same localities.  \n", "We will fill in the missing values based on the location of the object, according to the name of the locality.  "], ["As we can see, the histogram has changed only slightly, indicating that we did not distort the original data.  \n", "However, if we continue to fill in the remaining missing values with the median for L.O., the changes will be too significant.  \n", "We leave the remaining missing values as they are.  "], ["#### Filling in the Missing Values in the 'ceiling_height' Column"], ["A very large number of missing values and unrealistic ceiling height values were found:\n", "- Values above 20 meters were interpreted as entries in incorrect units of measurement, for example, instead of 2.5 meters, it was recorded as 25. The reason may be that the data could be collected in mm or cm, and when rounded to meters, data originally recorded in mm will be 10 times larger than the actual values. It is unlikely that the seller intended to indicate a ceiling height less than 2 meters, so the threshold value is set at 20 meters. Values above 20 meters were divided by 10;\n", "- Values from 6 meters to 20 meters were discarded as errors since a height of 6 meters is possible in some parts of living spaces (e.g., double-height spaces), but heights greater than 6 meters are unlikely. Values from 6 to 20 were replaced with the median;\n", "- Values less than 2 meters will be considered incorrect, discarded, and replaced.  \n", "  \n", "With such a large number of missing values, it is not possible to simply replace all the data with the median.  \n", "Let's assume that the ceiling height depends on the year of construction, with heights increasing closer to the historical center.  \n", "Let's test this assumption."], ["Indeed, there is a correlation between these two parameters: the closer to the center, the higher the ceilings.  \n", "Let's fill in the missing values in the data according to this pattern."], ["We divided the data based on the dependency of ceiling height into 10 slices and obtained the median value for each slice.  \n", "It can be seen that closer to the center, the average height is 3.10m, while beyond 10km from the center, it hardly exceeds 2.6m.  \n", "For objects where we have data on the distance to the center, let's replace the missing values with the obtained values."], ["The number of missing values has significantly decreased, but there are still 2174 remaining.  \n", "We can fill them with the median value for L.O., since there are no missing values left in St. Petersburg. Such replacement would be logical, but we won't fill in the remaining missing values due to the desire not to distort the original data too much."], ["#### Filling in the Missing Values in the 'floors_total' Column"], ["The values look realistic, as 9-story buildings are among the most common in Russia. The missing values are filled with the median.  \n", "After filling in the missing values, the histogram changed slightly."], ["#### Filling in the Missing Values in the 'living_area' Column"], ["The values ranging from 2 to 409.7 sq.m. of living area look realistic.  \n", "The missing values are filled with the median share of living area relative to the total area of the property, based on the price category.  \n", "From the change in the histogram, it can be seen that the data is not significantly distorted."], ["#### Filling in the Missing Values in the 'is_apartment' Column"], ["The type of apartments is not very popular in Russia, so if the seller did not indicate it, it is likely that the property is not an apartment.  \n", "The missing values are filled with the value 'False'."], ["#### Filling in the Missing Values in the 'kitchen_area' Column"], ["There is a property with a kitchen area of over 100 sq.m."], ["With a total area of 900 sq.m., it is likely that there are no errors in the data.  \n", "\n", "There are many zero values in the data. First, we need to determine the interpretation of such anomalies. Zero values can indicate errors or apartments without kitchens. Since a significant share of the market in St. Petersburg is occupied by communal apartments, the missing values in the data can indeed mean the absence of a kitchen. To find out, let's compare the data on the areas of all apartments and apartments with missing values in the kitchen column."], ["If we plot the histogram of all apartment areas and the histogram of apartment areas where the data on kitchens is missing, we can see that the latter graph is slightly shifted to the left.  \n", "It is likely that some of these apartments indeed have no kitchens, while in some cases, the values are missing. We need to distinguish between these cases since the missing values account for about 10%, and we cannot uniformly replace the data in order not to distort the values too much.  \n", "We have data on whether the apartment is a studio, let's check it."], ["Out of 2278 apartments without kitchens, 149 are studios. We will replace the data in these cases with 0 since studios have kitchens, but their area cannot be determined."], ["We can assume that apartments without kitchens and with an area smaller than a studio are communal apartments. For apartments with an area larger than the average studio area, it is likely that the values are missing."], ["For apartments that we consider communal, we will leave the missing values as they are.  \n", "For apartments with an area larger than the average studio area, we fill in the missing values with the median value of the kitchen area to the total area ratio."], ["Let's check how the histogram has changed."], ["The missing values are filled, and the data is not distorted."], ["#### Filling in the Missing Values in the 'balcony' Column"], ["If the data on the number of balconies is missing, it is likely that there are no balconies in the apartment.  \n", "The missing values are filled with a value of 0."], ["#### Filling in the Missing Values in the 'locality_name' Column"], ["The locality name will remain unknown since it is not possible to restore the data."], ["#### Filling in the Missing Values in the 'airports_nearest' Column"], ["Let's see how the location of the property relates to the distance to the airport."], ["The missing values for the distance to the airport are mainly found in L.O., with only 85 missing values in St. Petersburg.  \n", "When filling in the missing values, we can rely on the data of objects located in the same localities.  \n", "Let's fill in the missing values according to the location of the property, based on the name of the locality.  "], ["As we can see, the histogram has changed slightly, indicating that we have slightly distorted the original data.  \n", "However, if we continue to fill in the missing values with the median for L.O., the changes would be too significant.  \n", "We won't fill in the remaining missing values since it is not possible to determine the distance to the airport."], ["#### Filling in the Missing Values in the Columns: 'parks_nearest', 'parks_around3000', 'ponds_nearest', 'ponds_around3000'"], ["'parks_around3000' indicates the number of parks within a 3000m radius:\n", "- if parks > 0, the nearest park is indicated in 'parks_nearest';\n", "- if <=0, the field remains empty.  \n", "\n", "At the same time, some values in 'parks_around3000' are filled with 0, while others are NaN. It makes sense to fill in the missing values with zeros to avoid confusion.\n", "NaN values in the 'parks_nearest' column remain unchanged.\n", "\n", "The same applies to the data on ponds."], ["#### Filling in the Missing Values in the 'days_expositions' Column"], ["The missing values in 'days_expositions' should remain as missing values since the listings are still active."], ["**Let's double-check the result of preprocessing:**"], ["As a result of the work performed, the data types have been aligned with the data in the columns.\n", "\n", "The number of duplicates in the location names has been reduced.\n", "\n", "The missing values have been filled in the following columns:\n", "- building floors;\n", "- living area;\n", "- whether the property is an apartment;\n", "- presence of balconies;\n", "- presence of parks and ponds within a 3000-meter radius.\n", "\n", "The number of missing values has been reduced in the following columns:\n", "- ceiling height;\n", "- kitchen area;\n", "- distance to the airport;\n", "- distance to the city center."], ["## Adding New Features"], ["Based on the available data, we can add new features."], ["The following columns have been added to the table:\n", "- column with price per square meter;\n", "- column with the day of the week when the ad was published (0 - Monday, 1 - Tuesday, etc.);\n", "- column with the month when the ad was published;\n", "- column with the year when the ad was published;\n", "- column with the floor type of the apartment (values: 'first', 'last', 'other');\n", "- column with the distance to the city center in kilometers."], ["## Exploratory Data Analysis"], ["### Number of Rooms"], ["One-room apartments are the most common, followed closely by two-room apartments, then three-room apartments, and so on."], ["### Living Area"], ["At first glance, the data appears to consist of several overlapping histograms with a distribution close to normal. This may be due to the number of rooms in the apartments. Let's test this assumption."], ["The assumption has been confirmed. Indeed, the data is fine, and the three peaks represent the three types of apartments based on the number of rooms."], ["### Total Area"], ["The distribution of apartment areas resembles a Poisson curve with a sawtooth edge. It is logical to assume that this shape has the same nature as in the case of the living area.\n", "Overall, the data looks natural, and both 12 and 900 square meters are realistic sizes for residential properties."], ["### Kitchen Area"], ["The most common kitchen size is 9 square meters.\n", "Zero values were assigned to studio apartments.\n", "The maximum area is 112 square meters."], ["### Property Price"], ["Prices vary over a wide range, with the most common deals falling between 3.4 and 6.8 million rubles."], ["### Ceiling Height"], ["The most common ceiling height is 2.6 meters.\n", "Ceiling heights vary depending on the year of construction and, as a result, the distance from the historical city center.\n", "Within a five-kilometer radius of the city center, the median ceiling height is 3.1 meters."], ["### Apartment Floor"], ["Most apartments are located on the first floor. Every building has a first floor, while the second and subsequent floors are less common."], ["### Floor Type"], ["If we compare the frequency of apartments on the first and last floors, we will find that apartments on the first floor are less frequently listed. This is because built-in premises are often located on the first floors, especially in new buildings, which is due to changes in regulatory documents in housing construction."], ["### Total Number of Floors in the Building"], ["Four- and five-story buildings are the most common, followed by nine-story buildings. There are also peaks at 17-18 floors and 25 floors.\n", "All of these peaks are related to regulations in housing construction, such as the number of elevators, accessibility of the upper floors via fire escape stairs, the presence of a fire helicopter in the city, and so on."], ["### Distance to City Center in Meters"], ["The largest number of properties are located in the range of 9-17 km. Overall, the graph appears somewhat uneven, which can be attributed to variations in urban development, industrial zones, terrain features, and so on."], ["### Distance to Nearest Airport"], ["Similar to the histogram of distances to the city center, the graph appears uneven. However, it can be clearly seen that the majority of properties are located within a range of 19-38 km."], ["### Distance to Nearest Park"], ["In this column, we left many missing values because only parks within a distance of less than 3000 meters were considered.\n", "However, the histogram shows that the majority of properties are located within 300-600 meters from a park, while parks at a distance of more than one and a half kilometers are extremely rare. This indicates that the park system in St. Petersburg is efficiently designed."], ["### Day and Month of Ad Publication"], ["The lowest number of publications falls on weekends, while the highest is during the period from Tuesday to Friday.\n", "By months, the differences are also significant, with the lowest activity in December, January (which can be easily explained), and May.\n", "The highest activity is from February to April."], ["**As a result of exploratory data analysis**, the following data on real estate properties were examined and interpreted:\n", "- number of rooms;\n", "- living area;\n", "- total area;\n", "- kitchen area;\n", "- property price;\n", "- ceiling height;\n", "- apartment floor;\n", "- floor type;\n", "- total number of floors in the building;\n", "- distance to the city center in meters;\n", "- distance to the nearest airport;\n", "- distance to the nearest park;\n", "- day and month of ad publication."], ["## Time to Sell a Property"], ["The average time for a property to sell is 95 days.\n", "Sales that take less than 45 days can be considered fast.\n", "Sales that take more than 232 days are unusually long."], ["## Which Factors Most Affect the Total Price of a Property?"], ["Let's assess the features based on the correlation coefficient and scatter plot."], ["### Total Area"], ["The Pearson coefficient of 0.65 and the scatter plot indicate a positive correlation between the total area of the property and its price."], ["### Living Area"], ["There is a positive correlation between the living area of the property and its price. The Pearson coefficient is 0.58, slightly lower than the correlation between the total area and the price."], ["### Kitchen Area"], ["There is also a positive correlation between the kitchen area and the price of the property. The Pearson coefficient is 0.49, which is lower than the coefficients for the total area and the living area."], ["### Number of Rooms"], ["The price of the property depends on the number of rooms. There is a direct correlation from 1 to 8 rooms, and for more than 8 rooms, there is a slight decline in prices."], ["### Floor Type"], ["In terms of floor type, prices of properties are arranged in the following order: first floors, last floors, and others."], ["### Publication Date"], ["#### Day of the Week"], ["By the middle of the week, the prices for ads are slightly higher than at the beginning and on weekends.\n", "This can be attributed to the fact that sellers of more expensive real estate often turn to real estate agents, who often include their fees in the price of the property. These agents do not work on weekends, while sellers of cheaper properties post ads themselves, including on weekends."], ["#### Month"], ["Prices vary from month to month, but no specific patterns were identified."], ["#### Year"], ["After 2014, property prices decreased for two years and then stabilized."], ["The price of a property is influenced by the following parameters:\n", "- total area;\n", "- living area;\n", "- kitchen area;\n", "- number of rooms;\n", "- floor type.\n", "\n", "There is also a correlation between the price and the year of ad publication. A slight correlation is observed between the price and the day of the week. No correlation was found between the price and the month."], ["## Cities with the Highest and Lowest Price per Square Meter"], ["Among the top 10 cities with the highest number of ads, the lowest price per square meter is in Vyborg, while the highest is in St. Petersburg."], ["## Correlation between Property Price and Distance to the City Center"], ["There is a dependence between the distance to the city center and the price of the property.\n", "The closer the property is to the city center, the more expensive it is."], ["## Overall Conclusion"], ["In the initial stage, the data were quickly reviewed, and further actions for data preprocessing were evaluated.\n", "During the data preprocessing stage, the following operations were performed on the data:\n", "- data type conversion;\n", "- identification and removal of duplicates;\n", "- filling in missing values;\n", "- correction and interpretation of anomalous data.\n", "\n", "New columns with calculated data were added, which were subsequently used in the analysis.\n", "During the exploratory data analysis stage, the main parameters of the properties and the time it took to sell them were examined and interpreted.\n", "\n", "In the next and final stage, dependencies between various property parameters and their prices were discovered. The correlation between the property prices and the distance to the city center was also examined.\n", "The most significant finding is the correlation between the price and the following parameters: total area, living area, kitchen area, number of rooms, and distance to the city center.\n", "\n", "The results of this work can be useful for assessing deviations in property prices from the market average, evaluating new properties, and developing a recommendation system for property valuation."]]